keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_bf.h
/** \\brief  Length for Ifx_CAN_MO_AR_Bits.PRI */
#define IFX_CAN_MO_AR_PRI_LEN (2)

/** \\brief  Mask for Ifx_CAN_MO_AR_Bits.PRI */
#define IFX_CAN_MO_AR_PRI_MSK (0x3)

/** \\brief  Offset for Ifx_CAN_MO_AR_Bits.PRI */
#define IFX_CAN_MO_AR_PRI_OFF (30)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESDIR */
#define IFX_CAN_MO_CTR_STAT_CTR_RESDIR_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESDIR */
#define IFX_CAN_MO_CTR_STAT_CTR_RESDIR_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESDIR */
#define IFX_CAN_MO_CTR_STAT_CTR_RESDIR_OFF (11)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESMSGLST */
#define IFX_CAN_MO_CTR_STAT_CTR_RESMSGLST_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESMSGLST */
#define IFX_CAN_MO_CTR_STAT_CTR_RESMSGLST_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESMSGLST */
#define IFX_CAN_MO_CTR_STAT_CTR_RESMSGLST_OFF (4)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESMSGVAL */
#define IFX_CAN_MO_CTR_STAT_CTR_RESMSGVAL_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESMSGVAL */
#define IFX_CAN_MO_CTR_STAT_CTR_RESMSGVAL_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESMSGVAL */
#define IFX_CAN_MO_CTR_STAT_CTR_RESMSGVAL_OFF (5)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESNEWDAT */
#define IFX_CAN_MO_CTR_STAT_CTR_RESNEWDAT_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESNEWDAT */
#define IFX_CAN_MO_CTR_STAT_CTR_RESNEWDAT_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESNEWDAT */
#define IFX_CAN_MO_CTR_STAT_CTR_RESNEWDAT_OFF (3)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESRTSEL */
#define IFX_CAN_MO_CTR_STAT_CTR_RESRTSEL_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESRTSEL */
#define IFX_CAN_MO_CTR_STAT_CTR_RESRTSEL_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESRTSEL */
#define IFX_CAN_MO_CTR_STAT_CTR_RESRTSEL_OFF (6)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESRXEN */
#define IFX_CAN_MO_CTR_STAT_CTR_RESRXEN_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESRXEN */
#define IFX_CAN_MO_CTR_STAT_CTR_RESRXEN_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESRXEN */
#define IFX_CAN_MO_CTR_STAT_CTR_RESRXEN_OFF (7)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESRXPND */
#define IFX_CAN_MO_CTR_STAT_CTR_RESRXPND_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESRXPND */
#define IFX_CAN_MO_CTR_STAT_CTR_RESRXPND_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESRXPND */
#define IFX_CAN_MO_CTR_STAT_CTR_RESRXPND_OFF (0)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESRXUPD */
#define IFX_CAN_MO_CTR_STAT_CTR_RESRXUPD_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESRXUPD */
#define IFX_CAN_MO_CTR_STAT_CTR_RESRXUPD_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESRXUPD */
#define IFX_CAN_MO_CTR_STAT_CTR_RESRXUPD_OFF (2)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESTXEN0 */
#define IFX_CAN_MO_CTR_STAT_CTR_RESTXEN0_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESTXEN0 */
#define IFX_CAN_MO_CTR_STAT_CTR_RESTXEN0_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESTXEN0 */
#define IFX_CAN_MO_CTR_STAT_CTR_RESTXEN0_OFF (9)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESTXEN1 */
#define IFX_CAN_MO_CTR_STAT_CTR_RESTXEN1_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESTXEN1 */
#define IFX_CAN_MO_CTR_STAT_CTR_RESTXEN1_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESTXEN1 */
#define IFX_CAN_MO_CTR_STAT_CTR_RESTXEN1_OFF (10)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESTXPND */
#define IFX_CAN_MO_CTR_STAT_CTR_RESTXPND_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESTXPND */
#define IFX_CAN_MO_CTR_STAT_CTR_RESTXPND_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESTXPND */
#define IFX_CAN_MO_CTR_STAT_CTR_RESTXPND_OFF (1)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESTXRQ */
#define IFX_CAN_MO_CTR_STAT_CTR_RESTXRQ_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESTXRQ */
#define IFX_CAN_MO_CTR_STAT_CTR_RESTXRQ_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.RESTXRQ */
#define IFX_CAN_MO_CTR_STAT_CTR_RESTXRQ_OFF (8)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETDIR */
#define IFX_CAN_MO_CTR_STAT_CTR_SETDIR_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETDIR */
#define IFX_CAN_MO_CTR_STAT_CTR_SETDIR_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETDIR */
#define IFX_CAN_MO_CTR_STAT_CTR_SETDIR_OFF (27)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETMSGLST */
#define IFX_CAN_MO_CTR_STAT_CTR_SETMSGLST_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETMSGLST */
#define IFX_CAN_MO_CTR_STAT_CTR_SETMSGLST_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETMSGLST */
#define IFX_CAN_MO_CTR_STAT_CTR_SETMSGLST_OFF (20)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETMSGVAL */
#define IFX_CAN_MO_CTR_STAT_CTR_SETMSGVAL_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETMSGVAL */
#define IFX_CAN_MO_CTR_STAT_CTR_SETMSGVAL_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETMSGVAL */
#define IFX_CAN_MO_CTR_STAT_CTR_SETMSGVAL_OFF (21)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETNEWDAT */
#define IFX_CAN_MO_CTR_STAT_CTR_SETNEWDAT_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETNEWDAT */
#define IFX_CAN_MO_CTR_STAT_CTR_SETNEWDAT_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETNEWDAT */
#define IFX_CAN_MO_CTR_STAT_CTR_SETNEWDAT_OFF (19)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETRTSEL */
#define IFX_CAN_MO_CTR_STAT_CTR_SETRTSEL_LEN (1)

